# IsAnalyticalElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalToPhysicalAssociationManager..::..IsAnalyticalElement Method
AnalyticalToPhysicalAssociationManager Class See Also
---
Returns true if the element is an analytical element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static bool IsAnalyticalElement(
	Document doc,
	ElementId id
)
```

Visual Basic
---
```text
Public Shared Function IsAnalyticalElement ( _
	doc As Document, _
	id As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAnalyticalElement(
	Document^ doc,
	ElementId^ id
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Revit document.
id
    Type: Autodesk.Revit.DB..::..ElementId The element to be checked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace